In [1]:
import pandas as pd

In [7]:
filas = 'ventas1 ventas2 ventas3'.split()
filas

['ventas1', 'ventas2', 'ventas3']

In [8]:
columnas = 'zonaA zonaB zonaC'.split()
columnas

['zonaA', 'zonaB', 'zonaC']

In [9]:
datos = [[120,340,250],[210,450,250],[310,210,140]]

In [10]:
datos

[[120, 340, 250], [210, 450, 250], [310, 210, 140]]

In [12]:
dataframe = pd.DataFrame(datos,filas,columnas)

In [13]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [15]:
condicion1 = condicion = dataframe > 200

In [16]:
dataframe[condicion1]

         zonaA  zonaB  zonaC
ventas1    NaN    340  250.0
ventas2  210.0    450  250.0
ventas3  310.0    210    NaN

In [17]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [23]:
condicion2 = (dataframe['zonaA'] > 200 ) & (dataframe['zonaB'] > 300)

In [24]:
dataframe[condicion2]

         zonaA  zonaB  zonaC
ventas2    210    450    250

In [25]:
condicion2 = (dataframe['zonaA'] > 200 ) | (dataframe['zonaB'] > 300)

In [26]:
dataframe[condicion2]

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140